{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"x:0": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction:0": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "ConstantFolding/dropout_layer/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_layer/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "out/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/MatMul", "op": "MatMul", "input": ["x", "hidden_1/w"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/add", "op": "Add", "input": ["hidden_1/MatMul", "hidden_1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/Relu", "op": "Relu", "input": ["hidden_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Shape", "op": "Shape", "input": ["hidden_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "dropout_layer/add", "op": "Add", "input": ["dropout_layer/random_uniform/RandomUniform", "dropout_layer/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Floor", "op": "Floor", "input": ["dropout_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_layer/truediv_recip", "dropout_layer/Floor"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_layer/mul", "op": "Mul", "input": ["dropout_layer/truediv", "hidden_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "hidden_2/MatMul", "op": "MatMul", "input": ["dropout_layer/mul", "hidden_2/w"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "hidden_2/add", "op": "Add", "input": ["hidden_2/MatMul", "hidden_2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/Relu", "op": "Relu", "input": ["hidden_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/MatMul", "op": "MatMul", "input": ["hidden_2/Relu", "out/w"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "out/add", "op": "Add", "input": ["out/MatMul", "out/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["out/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ConstantFolding/dropout_layer/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "dropout_layer/sub", "shape": [], "dtype": "float32"}, {"name": "hidden_1/w", "shape": [784, 512], "dtype": "float32"}, {"name": "hidden_1/b", "shape": [512], "dtype": "float32"}, {"name": "hidden_2/w", "shape": [512, 64], "dtype": "float32"}, {"name": "hidden_2/b", "shape": [64], "dtype": "float32"}, {"name": "out/w", "shape": [64, 10], "dtype": "float32"}, {"name": "out/b", "shape": [10], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}